Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/FRW/src/Ifx_FRW_ParamTable.c
    /* Store valueTU in outputBuffer */
    if (responseCode == Ifx_FRW_ParamTable_ERR_NoError)
    {
        uint8_t bytes = paramEntry.bits.sizeTU + 1U;
        memcpy((void*)outputBuffer, (void*)&valueTU, bytes);
    }

    return responseCode;
}


static uint16_t Ifx_FRW_ParamTable_paramIndex(uint32_t const targetIdx)
{
    return (uint16_t)(((targetIdx) >> 8u) & 0xFFFFu);
}


static uint8_t Ifx_FRW_ParamTable_getSubIndex(uint32_t const targetIdx)
{
    return (uint8_t)(targetIdx & 0xFFu);
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_searchParamTable(uint16_t lowLimit, uint16_t highLimit, uint16_t
                                                                     targetIndex,
                                                                     Ifx_FRW_ParamTable_paramEntry* pEntry)
{
    uint16_t                  mid          = 0;
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_ParamNotFoundError;

    while (lowLimit <= highLimit)
    {
        mid = lowLimit + (highLimit - lowLimit) / 2u;

        if (Ifx_FRW_ParamTable_Table[mid].index == targetIndex)
        {
            responseCode = Ifx_FRW_ParamTable_ERR_NoError;
            *pEntry      = Ifx_FRW_ParamTable_Table[mid];
            break;
        }
        else
        {
            if (Ifx_FRW_ParamTable_Table[mid].index < targetIndex)
            {
                lowLimit = mid + 1u;
            }
            else
            {
                highLimit = mid - 1u;
            }
        }
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_checkSubIndex(uint8_t subIndex, uint8_t maxSubIndex)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_Error;

    if (subIndex > maxSubIndex)
    {
        responseCode = Ifx_FRW_ParamTable_ERR_SubIndexUnkown;
    }
    else
    {
        responseCode = Ifx_FRW_ParamTable_ERR_NoError;
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_getValueDU(Ifx_FRW_ParamTable_paramEntry paramEntry,
                                                               int64_t                     * valueDU)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_NoError;

    if (paramEntry.getParam != NULL)
    {
        /* Read the parameter value by calling the get-function in getParam. */
        responseCode = Ifx_FRW_ParamTable_getValueDU_getParam(paramEntry, valueDU);
    }
    else
    {
        /* Copy the value at the given address for this parameter to the outputBuffer (elementSize is given 0 =
         * 1byte
         * ... 3= 4byte) */
        *valueDU = Ifx_FRW_ParamTable_castToInt64(paramEntry.address, paramEntry.bits.isSignedDU,
            paramEntry.bits.sizeDU);
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_getValueDU_getParam(Ifx_FRW_ParamTable_paramEntry paramEntry,
                                                                        int64_t                     * valueDU)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_NoError;

    if (paramEntry.bits.isFloat)
    {
        responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
    }
    else
    {
        if (paramEntry.bits.multiInstance == true)
        {
            /* Call get with self ptr */
            responseCode = Ifx_FRW_ParamTable_getValueDU_getParamInstance(paramEntry, valueDU);
        }
        else
        {
            /* Call get without self ptr */
            responseCode = Ifx_FRW_ParamTable_getValuDU_getParamSingleton(paramEntry, valueDU);
        }
    }

    return responseCode;
}


/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "Handling of parameter attribute options leads to large but still
 * simple and repetitive structures. Further splitting of this option handling functions would reduce readability again
 * and kill the benefit of this metric which is improved readability and maintainability." */

/* polyspace-begin DEFECT:FUNC_CAST [Justified:Low] "See justification MISRA-C3:11.1" */
static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_getValueDU_getParamInstance(Ifx_FRW_ParamTable_paramEntry
                                                                                paramEntry, int64_t* valueDU)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_NoError;

    if (paramEntry.bits.isSignedDU == true)
    {
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                *valueDU = IFX_FRW_PARAMTABLE_GET_SELF(getFunc_self_i8, paramEntry);
                break;

            case 1:
                *valueDU = IFX_FRW_PARAMTABLE_GET_SELF(getFunc_self_i16, paramEntry);
                break;

            case 3:
                *valueDU = IFX_FRW_PARAMTABLE_GET_SELF(getFunc_self_i32, paramEntry);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }
    else
    {
        /* unsigned with self */
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                *valueDU = IFX_FRW_PARAMTABLE_GET_SELF(getFunc_self_u8, paramEntry);
                break;

            case 1:
                *valueDU = IFX_FRW_PARAMTABLE_GET_SELF(getFunc_self_u16, paramEntry);
                break;

            case 3:
                *valueDU = IFX_FRW_PARAMTABLE_GET_SELF(getFunc_self_u32, paramEntry);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_getValuDU_getParamSingleton(Ifx_FRW_ParamTable_paramEntry
                                                                                paramEntry, int64_t* valueDU)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_NoError;

    if (paramEntry.bits.isSignedDU == true)
    {
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                *valueDU = IFX_FRW_PARAMTABLE_GET(getFunc_i8, paramEntry);
                break;

            case 1:
                *valueDU = IFX_FRW_PARAMTABLE_GET(getFunc_i16, paramEntry);
                break;

            case 3:
                *valueDU = IFX_FRW_PARAMTABLE_GET(getFunc_i32, paramEntry);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }
    else
    {
        /* unsigned without self ptr */
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                *valueDU = IFX_FRW_PARAMTABLE_GET(getFunc_u8, paramEntry);
                break;

            case 1:
                *valueDU = IFX_FRW_PARAMTABLE_GET(getFunc_u16, paramEntry);
                break;

            case 3:
                *valueDU = IFX_FRW_PARAMTABLE_GET(getFunc_u32, paramEntry);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }

    return responseCode;
}


/* polyspace-end DEFECT:FUNC_CAST [Justified:Low] "See justification MISRA-C3:11.1" */
static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_scaleDUtoTU(const Ifx_FRW_ParamTable_paramEntry* paramEntry,
                                                                int64_t* pResult, int64_t inputValueDU)
{
    Ifx_FRW_ParamTable_Errors        responseCode = Ifx_FRW_ParamTable_ERR_NoError;
    Ifx_FRW_ParamTable_fractionParts fractionParts;
    Ifx_FRW_ParamTable_paramRanges   paramRanges  = Ifx_FRW_ParamTable_getParamRanges(paramEntry);
    *pResult = inputValueDU;

    if (Ifx_FRW_ParamTable_checkIfScalingIsRequired(paramRanges))
    {
        fractionParts = Ifx_FRW_ParamTable_calcFractionPartsDUtoTU(paramRanges, inputValueDU);

        if (fractionParts.denominator == 0)
        {
            responseCode = Ifx_FRW_ParamTable_ERR_DenominatorZero;
        }
        else if (Ifx_FRW_ParamTable_checkIfResultFitsIntoInt64(fractionParts.numerator1, fractionParts.numerator2))
        {
            *pResult = Ifx_FRW_ParamTable_calcScalingWithRounding(fractionParts, paramRanges.min_TU);
        }
        else
        {
            *pResult     = paramRanges.max_TU;
            responseCode = Ifx_FRW_ParamTable_ERR_NumeratorsOverflow;
        }
    }

    return responseCode;
}


Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_writeParam(uint32_t targetIndex, uint8_t* inputBuffer, bool motorRunning)
{
    Ifx_FRW_ParamTable_Errors     responseCode = Ifx_FRW_ParamTable_ERR_NoError;
    Ifx_FRW_ParamTable_paramEntry paramEntry;
    int64_t                       writeValue;
    uint16_t                      paramIndex = Ifx_FRW_ParamTable_paramIndex(targetIndex);
    uint8_t                       subIndex   = Ifx_FRW_ParamTable_getSubIndex(targetIndex);

    /* Get entry from paramTable by binary search */
    responseCode = Ifx_FRW_ParamTable_searchParamTable(0, IFX_FRW_PARAMTABLE_NUMPARAM - 1, paramIndex, &paramEntry);

    if (responseCode == Ifx_FRW_ParamTable_ERR_NoError)
    {
        responseCode = Ifx_FRW_ParamTable_checkSubIndex(subIndex, paramEntry.maxSubIndex);
    }

    if (responseCode == Ifx_FRW_ParamTable_ERR_NoError)
    {
        responseCode = Ifx_FRW_ParamTable_scaleTUtoDU(inputBuffer, &paramEntry, &writeValue);
    }

    if ((paramEntry.bits.writeAccess != true)
        && (responseCode == Ifx_FRW_ParamTable_ERR_NoError))
    {
        responseCode = Ifx_FRW_ParamTable_ERR_ReadOnly;
    }
    else if ((motorRunning == true)
             && (paramEntry.bits.changeWhileMotorRunning == false))
    {
        responseCode = Ifx_FRW_ParamTable_ERR_MotorRunning;
    }
    else
    {
        /* we keep potential errors from before */
    }

    if (responseCode == Ifx_FRW_ParamTable_ERR_NoError)
    {
        if (paramEntry.setParam != NULL)
        {
            /* Pass the inputBuffer to the given set-function for this parameter */
            responseCode = Ifx_FRW_ParamTable_setValueDU_setParam(paramEntry, writeValue);
        }
        else
        {
            uint8_t bytes = paramEntry.bits.sizeDU + 1U;

            /* Copy inputBuffer to parameter value */
            memcpy((void*)paramEntry.address, (void*)&writeValue, bytes);
            responseCode = Ifx_FRW_ParamTable_ERR_NoError;
        }
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_scaleTUtoDU(void* inputBuffer, const
                                                                Ifx_FRW_ParamTable_paramEntry* paramEntry,
                                                                int64_t* pResult)
{
    Ifx_FRW_ParamTable_Errors      responseCode;
    int64_t                        resultTemp;
    int64_t                        inputValueTU;
    Ifx_FRW_ParamTable_paramRanges paramRanges = Ifx_FRW_ParamTable_getParamRanges(paramEntry);
    *pResult     = (*(int64_t*)inputBuffer);
    inputValueTU = Ifx_FRW_ParamTable_castToInt64(inputBuffer, paramEntry->bits.isSignedTU, paramEntry->bits.sizeTU);
    responseCode = Ifx_FRW_ParamTable_checkMinMaxTU(paramEntry, inputValueTU);

    if ((responseCode == Ifx_FRW_ParamTable_ERR_NoError)
        && Ifx_FRW_ParamTable_checkIfScalingIsRequired(paramRanges))
    {
        Ifx_FRW_ParamTable_fractionParts fractionParts = Ifx_FRW_ParamTable_calcFractionPartsTUtoDU(paramRanges,
            inputValueTU);

        if (fractionParts.denominator == 0)
        {
            responseCode = Ifx_FRW_ParamTable_ERR_DenominatorZero;
        }
        else if (Ifx_FRW_ParamTable_checkIfResultFitsIntoInt64(fractionParts.numerator1, fractionParts.numerator2))
        {
            resultTemp   = (fractionParts.numerator1 * fractionParts.numerator2);
            resultTemp   = resultTemp / fractionParts.denominator;
            resultTemp   = resultTemp + paramRanges.min_DU;
            responseCode = Ifx_FRW_ParamTable_checkMinMaxDU(paramEntry, resultTemp);
            *pResult     = resultTemp;
        }
        else
        {
            responseCode = Ifx_FRW_ParamTable_ERR_NumeratorsOverflow;
        }
    }
    else
    {
        /* skip scaling */
    }

    return responseCode;
}


