Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/FRW/src/Ifx_FRW_ParamTable.c
static Ifx_FRW_ParamTable_paramRanges Ifx_FRW_ParamTable_getParamRanges(const
                                                                        Ifx_FRW_ParamTable_paramEntry* paramEntry)
{
    Ifx_FRW_ParamTable_paramRanges paramRanges;

    /* use uint32 max value if max value is too big for int32 */
    if (paramEntry->bits.isSignedDU)
    {
        paramRanges.min_DU = paramEntry->sMin_DU;
        paramRanges.max_DU = paramEntry->sMax_DU;
    }
    else
    {
        paramRanges.min_DU = (int64_t)paramEntry->uMin_DU;
        paramRanges.max_DU = (int64_t)paramEntry->uMax_DU;
    }

    if (paramEntry->bits.isSignedTU)
    {
        paramRanges.min_TU = paramEntry->sMin_TU;
        paramRanges.max_TU = paramEntry->sMax_TU;
    }
    else
    {
        paramRanges.min_TU = (int64_t)paramEntry->uMin_TU;
        paramRanges.max_TU = (int64_t)paramEntry->uMax_TU;
    }

    return paramRanges;
}


static inline bool Ifx_FRW_ParamTable_checkIfScalingIsRequired(Ifx_FRW_ParamTable_paramRanges paramRanges)
{
    bool scalingIsRequired;

    if ((paramRanges.max_TU != paramRanges.max_DU)
        || (paramRanges.min_TU != paramRanges.min_DU))
    {
        scalingIsRequired = true;
    }
    else
    {
        scalingIsRequired = false;
    }

    return scalingIsRequired;
}


static Ifx_FRW_ParamTable_fractionParts Ifx_FRW_ParamTable_calcFractionPartsTUtoDU(Ifx_FRW_ParamTable_paramRanges
                                                                                   paramRanges, int64_t inputValueTU)
{
    Ifx_FRW_ParamTable_fractionParts fractionParts;
    fractionParts.numerator1  = paramRanges.max_DU - paramRanges.min_DU;
    fractionParts.numerator2  = inputValueTU - paramRanges.min_TU;
    fractionParts.denominator = paramRanges.max_TU - paramRanges.min_TU;

    return fractionParts;
}


static Ifx_FRW_ParamTable_fractionParts Ifx_FRW_ParamTable_calcFractionPartsDUtoTU(Ifx_FRW_ParamTable_paramRanges
                                                                                   paramRanges, int64_t inputValueDU)
{
    Ifx_FRW_ParamTable_fractionParts fractionParts;
    fractionParts.numerator1  = paramRanges.max_TU - paramRanges.min_TU;
    fractionParts.numerator2  = inputValueDU - paramRanges.min_DU;
    fractionParts.denominator = paramRanges.max_DU - paramRanges.min_DU;

    return fractionParts;
}


static inline bool Ifx_FRW_ParamTable_checkIfResultFitsIntoInt64(int64_t numerator1, int64_t numerator2)
{
    bool resultFitsIntoInt64;

    if ((numerator1 == 0)
        || (numerator2 == 0))
    {
        resultFitsIntoInt64 = true;
    }
    else
    {
        if (numerator1 > (INT64_MAX / numerator2))
        {
            resultFitsIntoInt64 = false;
        }
        else if (numerator1 < (INT64_MIN / numerator2))
        {
            resultFitsIntoInt64 = false;
        }
        else
        {
            resultFitsIntoInt64 = true;
        }
    }

    return resultFitsIntoInt64;
}


static int64_t Ifx_FRW_ParamTable_calcScalingWithRounding(Ifx_FRW_ParamTable_fractionParts fractionParts, int64_t
                                                          min_TU)
{
    int64_t roundingOffset = (fractionParts.denominator / 2);
    int64_t resultTemp     = (fractionParts.numerator1 * fractionParts.numerator2);

    /* Scale with rounding requires to add an offset for positive input values or subtract it for negative
     * values before division */
    if ((resultTemp < 0)
        && (resultTemp >= (INT64_MIN + roundingOffset)))
    {
        resultTemp = (resultTemp - roundingOffset) / fractionParts.denominator;
    }
    else if ((resultTemp > 0)
             && (resultTemp <= (INT64_MAX - roundingOffset)))
    {
        resultTemp = (resultTemp + roundingOffset) / fractionParts.denominator;
    }
    else
    {
        resultTemp = resultTemp / fractionParts.denominator;
    }

    resultTemp = resultTemp + min_TU;

    return resultTemp;
}


static int64_t Ifx_FRW_ParamTable_castToInt64(void* element, bool isSigned, uint8_t elementSize)
{
    int64_t result = 0;

    switch (elementSize)
    {
        case 0:
            result = Ifx_FRW_ParamTable_castByteToInt64(element, isSigned);
            break;

        case 1:
            result = Ifx_FRW_ParamTable_castWordToInt64(element, isSigned);
            break;

        /* Because of the uint32_t case, result must be int64_t*/
        case 3:
            result = Ifx_FRW_ParamTable_castDWordToInt64(element, isSigned);
            break;

        default:
            result = 0;
            break;
    }

    return result;
}


static int64_t Ifx_FRW_ParamTable_castByteToInt64(void* element, bool isSigned)
{
    return (isSigned == true) ? IFX_FRW_PARAMTABLE_CAST_TO_I64(int8_t, element) : IFX_FRW_PARAMTABLE_CAST_TO_I64(
        uint8_t, element);
}


static int64_t Ifx_FRW_ParamTable_castWordToInt64(void* element, bool isSigned)
{
    return (isSigned == true) ? IFX_FRW_PARAMTABLE_CAST_TO_I64(int16_t, element) : IFX_FRW_PARAMTABLE_CAST_TO_I64(
        uint16_t, element);
}


static int64_t Ifx_FRW_ParamTable_castDWordToInt64(void* element, bool isSigned)
{
    return (isSigned == true) ? IFX_FRW_PARAMTABLE_CAST_TO_I64(int32_t, element) : IFX_FRW_PARAMTABLE_CAST_TO_I64(
        uint32_t, element);
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_checkMinMaxTU(const Ifx_FRW_ParamTable_paramEntry* paramEntry,
                                                                  int64_t                              inputValue)
{
    Ifx_FRW_ParamTable_Errors responseCode;

    if (paramEntry->bits.isSignedTU)
    {
        if (inputValue > paramEntry->sMax_TU)
        {
            responseCode = Ifx_FRW_ParamTable_ERR_ValueTooHigh;
        }
        else
        {
            if (inputValue < paramEntry->sMin_TU)
            {
                responseCode = Ifx_FRW_ParamTable_ERR_ValueTooLow;
            }
            else
            {
                /* No error, value can be scaled to DU */
                responseCode = Ifx_FRW_ParamTable_ERR_NoError;
            }
        }
    }
    else
    {
        if ((uint32_t)inputValue > paramEntry->uMax_TU)
        {
            responseCode = Ifx_FRW_ParamTable_ERR_ValueTooHigh;
        }
        else
        {
            if ((uint32_t)inputValue < paramEntry->uMin_TU)
            {
                responseCode = Ifx_FRW_ParamTable_ERR_ValueTooLow;
            }
            else
            {
                /* No error, value can be scaled to DU */
                responseCode = Ifx_FRW_ParamTable_ERR_NoError;
            }
        }
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_checkMinMaxDU(const Ifx_FRW_ParamTable_paramEntry* paramEntry,
                                                                  int64_t                              inputValue)
{
    Ifx_FRW_ParamTable_Errors responseCode;

    if (paramEntry->bits.isSignedDU)
    {
        if (inputValue > paramEntry->sMax_DU)
        {
            responseCode = Ifx_FRW_ParamTable_ERR_ValueTooHigh;
        }
        else
        {
            if (inputValue < paramEntry->sMin_DU)
            {
                responseCode = Ifx_FRW_ParamTable_ERR_ValueTooLow;
            }
            else
            {
                /* No error, value can be scaled to DU */
                responseCode = Ifx_FRW_ParamTable_ERR_NoError;
            }
        }
    }
    else
    {
        if ((uint32_t)inputValue > paramEntry->uMax_DU)
        {
            responseCode = Ifx_FRW_ParamTable_ERR_ValueTooHigh;
        }
        else
        {
            if ((uint32_t)inputValue < paramEntry->uMin_DU)
            {
                responseCode = Ifx_FRW_ParamTable_ERR_ValueTooLow;
            }
            else
            {
                /* No error, value can be scaled to DU */
                responseCode = Ifx_FRW_ParamTable_ERR_NoError;
            }
        }
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_setValueDU_setParam(Ifx_FRW_ParamTable_paramEntry paramEntry,
                                                                        int64_t                       valueDU)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_NoError;

