Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/FRW/src/Ifx_FRW_ParamTable.c
    if (paramEntry.bits.isFloat)
    {
        responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
    }
    else
    {
        if (paramEntry.bits.multiInstance == true)
        {
            responseCode = Ifx_FRW_ParamTable_setValueDU_setParamInstance(paramEntry, valueDU);
        }
        else
        {
            responseCode = Ifx_FRW_ParamTable_setValueDU_setParamSingleton(paramEntry, valueDU);
        }
    }

    return responseCode;
}


/* polyspace-begin DEFECT:FUNC_CAST [Justified:Low] "See justification MISRA-C3:11.1" */
static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_setValueDU_setParamInstance(Ifx_FRW_ParamTable_paramEntry
                                                                                paramEntry, int64_t valueDU)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_NoError;

    if (paramEntry.bits.isSignedDU == true)
    {
        /* signed with self */
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                IFX_FRW_PARAMTABLE_SET_SELF(setFunc_self_i8, paramEntry, (int8_t)valueDU);
                break;

            case 1:
                IFX_FRW_PARAMTABLE_SET_SELF(setFunc_self_i16, paramEntry, (int16_t)valueDU);
                break;

            case 3:
                IFX_FRW_PARAMTABLE_SET_SELF(setFunc_self_i32, paramEntry, (int32_t)valueDU);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }
    else
    {
        /* unsigned with self */
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                IFX_FRW_PARAMTABLE_SET_SELF(setFunc_self_u8, paramEntry, (uint8_t)valueDU);
                break;

            case 1:
                IFX_FRW_PARAMTABLE_SET_SELF(setFunc_self_u16, paramEntry, (uint16_t)valueDU);
                break;

            case 3:
                IFX_FRW_PARAMTABLE_SET_SELF(setFunc_self_u32, paramEntry, (uint32_t)valueDU);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }

    return responseCode;
}


static Ifx_FRW_ParamTable_Errors Ifx_FRW_ParamTable_setValueDU_setParamSingleton(Ifx_FRW_ParamTable_paramEntry
                                                                                 paramEntry, int64_t valueDU)
{
    Ifx_FRW_ParamTable_Errors responseCode = Ifx_FRW_ParamTable_ERR_NoError;

    if (paramEntry.bits.isSignedDU == true)
    {
        /* signed without self ptr */
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                IFX_FRW_PARAMTABLE_SET(setFunc_i8, paramEntry, (int8_t)valueDU);
                break;

            case 1:
                IFX_FRW_PARAMTABLE_SET(setFunc_i16, paramEntry, (int16_t)valueDU);
                break;

            case 3:
                IFX_FRW_PARAMTABLE_SET(setFunc_i32, paramEntry, (int32_t)valueDU);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }
    else
    {
        /* unsigned without self ptr */
        switch (paramEntry.bits.sizeDU)
        {
            case 0:
                IFX_FRW_PARAMTABLE_SET(setFunc_u8, paramEntry, (uint8_t)valueDU);
                break;

            case 1:
                IFX_FRW_PARAMTABLE_SET(setFunc_u16, paramEntry, (uint16_t)valueDU);
                break;

            case 3:
                IFX_FRW_PARAMTABLE_SET(setFunc_u32, paramEntry, (uint32_t)valueDU);
                break;

            default:
                responseCode = Ifx_FRW_ParamTable_ERR_NotImplemented;
                break;
        }
    }

    return responseCode;
}


/* polyspace-end DEFECT:FUNC_CAST [Justified:Low] "See justification MISRA-C3:11.1" */

/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "Handling of parameter attribute options leads to large but still
 * simple and repetitive structures. Further splitting of this option handling functions would reduce readabilty again
 * and kill the benefit of this metric which is improved readability and maintainability." */
uint8_t Ifx_FRW_ParamTable_getParamSize(uint32_t targetIndex)
{
    uint8_t                       retVal;
    uint16_t                      paramIndex = Ifx_FRW_ParamTable_paramIndex(targetIndex);
    Ifx_FRW_ParamTable_paramEntry paramEntry;
    Ifx_FRW_ParamTable_Errors     responseCode;

    /* Get entry from paramTable by binary search */
    responseCode = Ifx_FRW_ParamTable_searchParamTable(0, IFX_FRW_PARAMTABLE_NUMPARAM - 1, paramIndex, &paramEntry);

    if (responseCode == Ifx_FRW_ParamTable_ERR_NoError)
    {
        retVal = paramEntry.bits.sizeTU + 1u;
    }
    else
    {
        retVal = 1u;
    }

    return retVal;
}
